tutorial_AV/2D_bubble_250m/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default        Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         Gauss cubic;//upwind;
    div(phi,U)      Gauss cubic; //upwind;
    div(phi,h)      Gauss cubic; // upwind;
    div(phi,e)      Gauss cubic;//upwind;
    div(phi,k)      Gauss cubic; //upwind;
    div(phi,epsilon)  Gauss cubic; //upwind;
    div(phi,R)       Gauss cubic; //upwind;
    div(phi,K)       Gauss cubic;
    div(phi,Ekp)     Gauss cubic;
    div(R)         Gauss cubic;
    div(((rho*nuEff)*dev2(T(grad(U)))))  Gauss cubic; //linear;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}


// ************************************************************************* //
